# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
connection = sqlite3.connect('data.sqlite')
cursor = connection.cursor()

In [3]:
import pandas as pd

## Display the names of all the employees in Boston.

In [2]:
#Your code here
cursor.execute('''SELECT firstName, lastName from employees join offices using(officeCode) WHERE city =="Boston";''').fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [15]:
#Your code here
cursor.execute('''SELECT city, count(*) from offices left join employees using (officeCode) GROUP BY 1 Order BY 2;''').fetchall()

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Tokyo', 2),
 ('Sydney', 4),
 ('Paris', 5),
 ('San Francisco', 6)]

## Write 3 Questions of your own and answer them

How many products each product line has?

In [17]:
# Answers will vary
cursor.execute('''SELECT productLine, count(*) 
    from productlines 
    left join products using (productLine) 
    GROUP BY 1 Order BY 2;''').fetchall()

[('Trains', 3),
 ('Ships', 9),
 ('Trucks and Buses', 11),
 ('Planes', 12),
 ('Motorcycles', 13),
 ('Vintage Cars', 24),
 ('Classic Cars', 38)]

How many different vendors the company has, and how many products each vendor sells?

In [25]:
# Your code here
cursor.execute('''
SELECT productVendor, Count(*)
FROM products
GROUP BY 1
ORDER BY 2;
''').fetchall()

[('Red Start Diecast', 7),
 ('Autoart Studio Design', 8),
 ('Min Lin Diecast', 8),
 ('Second Gear Diecast', 8),
 ('Studio M Art Models', 8),
 ('Unimax Art Galleries', 8),
 ('Welly Diecast Productions', 8),
 ('Carousel DieCast Legends', 9),
 ('Exoto Designs', 9),
 ('Gearbox Collectibles', 9),
 ('Highway 66 Mini Classics', 9),
 ('Motor City Art Classics', 9),
 ('Classic Metal Creations', 10)]

Who are the top 3 customers by number of orders?

In [43]:
cursor.execute('''
SELECT customerNumber, count()
FROM orders
Group BY 1
ORDER BY 2 DESC
Limit 3;
''').fetchall()

[('141', 26), ('124', 17), ('114', 5)]

## Level Up: Display the names of each product each employee has sold.

In [47]:
# Your code here
cursor.execute('''
SELECT firstName, lastName, productName
FROM employees
JOIN customers on employees.employeeNumber = customers.salesRepEmployeeNumber
JOIN orders USING(customerNumber)
JOIN orderdetails USING(orderNumber)
JOIN products USING(productCode);
''')
df = pd.DataFrame(cursor.fetchall())
df.columns = ['eFirst_Name', 'eLast_Name', 'Product_Sold']
print(len(df))
df.head()

2996

  eFirst_Name eLast_Name                                 Product_Sold
0      Leslie   Jennings                               1958 Setra Bus
1      Leslie   Jennings                       1940 Ford Pickup Truck
2      Leslie   Jennings                      1939 Cadillac Limousine
3      Leslie   Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4      Leslie   Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [49]:
#Your code here
df.groupby(['eFirst_Name','eLast_Name']).count()

                        Product_Sold
eFirst_Name eLast_Name
Andy        Fixter               185
Barry       Jones                220
Foon Yue    Tseng                142
George      Vanauf               211
Gerard      Hernandez            396
Julie       Firrelli             124
Larry       Bott                 236
Leslie      Jennings             331
            Thompson             114
Loui        Bondur               177
Mami        Nishi                137
Martin      Gerard               114
Pamela      Castillo             272
Peter       Marsh                185
Steve       Patterson            152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!